espressif/esp-idf/components/soc/esp32h4/register/soc/lp_gpio_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** LP_GPIO_OUT_REG register
 *  LP_GPIO output register
 */
#define LP_GPIO_OUT_REG (DR_REG_LP_GPIO_BASE + 0x4)
/** LP_GPIO_OUT_DATA_ORIG : R/W/WTC; bitpos: [5:0]; default: 0;
 *  Configures the output value of LP_GPIO0 ~ 5 output in simple LP_GPIO output mode.
 *  0: Low level
 *  1: High level
 *  The value of bit0 ~ bit5 correspond to the output value of LP_GPIO0 ~ LP_GPIO5
 *  respectively. Bitxx ~ bitxx is invalid.
 */
#define LP_GPIO_OUT_DATA_ORIG    0x0000003FU
#define LP_GPIO_OUT_DATA_ORIG_M  (LP_GPIO_OUT_DATA_ORIG_V << LP_GPIO_OUT_DATA_ORIG_S)
#define LP_GPIO_OUT_DATA_ORIG_V  0x0000003FU
#define LP_GPIO_OUT_DATA_ORIG_S  0

/** LP_GPIO_OUT_W1TS_REG register
 *  LP_GPIO output set register
 */
#define LP_GPIO_OUT_W1TS_REG (DR_REG_LP_GPIO_BASE + 0x8)
/** LP_GPIO_OUT_W1TS : WT; bitpos: [5:0]; default: 0;
 *  Configures whether or not to set the output register LP_GPIO_OUT_REG of LP_GPIO0 ~
 *  LP_GPIO5.
 *  0: Not set
 *  1: The corresponding bit in LP_GPIO_OUT_REG will be set to 1
 *  Bit0 ~ bit5 are corresponding to LP_GPIO0 ~ LP_GPIO5. Bitxx ~ bitxx is invalid.
 *  Recommended operation: use this register to set LP_GPIO_OUT_REG.
 */
#define LP_GPIO_OUT_W1TS    0x0000003FU
#define LP_GPIO_OUT_W1TS_M  (LP_GPIO_OUT_W1TS_V << LP_GPIO_OUT_W1TS_S)
#define LP_GPIO_OUT_W1TS_V  0x0000003FU
#define LP_GPIO_OUT_W1TS_S  0

/** LP_GPIO_OUT_W1TC_REG register
 *  LP_GPIO output clear register
 */
#define LP_GPIO_OUT_W1TC_REG (DR_REG_LP_GPIO_BASE + 0xc)
/** LP_GPIO_OUT_W1TC : WT; bitpos: [5:0]; default: 0;
 *  Configures whether or not to clear the output register LP_GPIO_OUT_REG of LP_GPIO0
 *  ~ LP_GPIO5 output.
 *  0: Not clear
 *  1: The corresponding bit in LP_GPIO_OUT_REG will be cleared.
 *  Bit0 ~ bit5 are corresponding to LP_GPIO0 ~ LP_GPIO5. Bitxx ~ bitxx is invalid.
 *  Recommended operation: use this register to clear LP_GPIO_OUT_REG.
 */
#define LP_GPIO_OUT_W1TC    0x0000003FU
#define LP_GPIO_OUT_W1TC_M  (LP_GPIO_OUT_W1TC_V << LP_GPIO_OUT_W1TC_S)
#define LP_GPIO_OUT_W1TC_V  0x0000003FU
#define LP_GPIO_OUT_W1TC_S  0

/** LP_GPIO_ENABLE_REG register
 *  LP_GPIO output enable register
 */
#define LP_GPIO_ENABLE_REG (DR_REG_LP_GPIO_BASE + 0x10)
/** LP_GPIO_ENABLE_DATA : R/W/WTC; bitpos: [5:0]; default: 0;
 *  Configures whether or not to enable the output of LP_GPIO0 ~ LP_GPIO5.
 *  0: Not enable
 *  1: Enable
 *  Bit0 ~ bit5 are corresponding to LP_GPIO0 ~ LP_GPIO5. Bitxx ~ bitxx is invalid.
 */
#define LP_GPIO_ENABLE_DATA    0x0000003FU
#define LP_GPIO_ENABLE_DATA_M  (LP_GPIO_ENABLE_DATA_V << LP_GPIO_ENABLE_DATA_S)
#define LP_GPIO_ENABLE_DATA_V  0x0000003FU
#define LP_GPIO_ENABLE_DATA_S  0

/** LP_GPIO_ENABLE_W1TS_REG register
 *  LP_GPIO output enable set register
 */
#define LP_GPIO_ENABLE_W1TS_REG (DR_REG_LP_GPIO_BASE + 0x14)
/** LP_GPIO_ENABLE_W1TS : WT; bitpos: [5:0]; default: 0;
 *  Configures whether or not to set the output enable register LP_GPIO_ENABLE_REG of
 *  LP_GPIO0 ~ LP_GPIO5.
 *  0: Not set
 *  1: The corresponding bit in LP_GPIO_ENABLE_REG will be set to 1
 *  Bit0 ~ bit5 are corresponding to LP_GPIO0 ~ LP_GPIO5. Bitxx ~ bitxx is invalid.
 *  Recommended operation: use this register to set LP_GPIO_ENABLE_REG.
 */
#define LP_GPIO_ENABLE_W1TS    0x0000003FU
#define LP_GPIO_ENABLE_W1TS_M  (LP_GPIO_ENABLE_W1TS_V << LP_GPIO_ENABLE_W1TS_S)
#define LP_GPIO_ENABLE_W1TS_V  0x0000003FU
#define LP_GPIO_ENABLE_W1TS_S  0

/** LP_GPIO_ENABLE_W1TC_REG register
 *  LP_GPIO output enable clear register
 */
#define LP_GPIO_ENABLE_W1TC_REG (DR_REG_LP_GPIO_BASE + 0x18)
/** LP_GPIO_ENABLE_W1TC : WT; bitpos: [5:0]; default: 0;
 *  Configures whether or not to clear the output enable register LP_GPIO_ENABLE_REG of
 *  LP_GPIO0 ~ LP_GPIO5.
 *  0: Not clear
 *  1: The corresponding bit in LP_GPIO_ENABLE_REG will be cleared
 *  Bit0 ~ bit5 are corresponding to LP_GPIO0 ~ LP_GPIO5. Bitxx ~ bitxx is invalid.
 *  Recommended operation: use this register to clear LP_GPIO_ENABLE_REG.
 */
#define LP_GPIO_ENABLE_W1TC    0x0000003FU
#define LP_GPIO_ENABLE_W1TC_M  (LP_GPIO_ENABLE_W1TC_V << LP_GPIO_ENABLE_W1TC_S)
#define LP_GPIO_ENABLE_W1TC_V  0x0000003FU
#define LP_GPIO_ENABLE_W1TC_S  0

/** LP_GPIO_IN_REG register
 *  LP_GPIO input register
 */
#define LP_GPIO_IN_REG (DR_REG_LP_GPIO_BASE + 0x1c)
/** LP_GPIO_IN_DATA_NEXT : RO; bitpos: [5:0]; default: 0;
 *  Represents the input value of LP_GPIO0 ~ LP_GPIO5. Each bit represents a pin input
 *  value:
 *  0: Low level
 *  1: High level
 *  Bit0 ~ bit5 are corresponding to LP_GPIO0 ~ LP_GPIO5. Bitxx ~ bitxx is invalid.
 */
#define LP_GPIO_IN_DATA_NEXT    0x0000003FU
#define LP_GPIO_IN_DATA_NEXT_M  (LP_GPIO_IN_DATA_NEXT_V << LP_GPIO_IN_DATA_NEXT_S)
#define LP_GPIO_IN_DATA_NEXT_V  0x0000003FU
#define LP_GPIO_IN_DATA_NEXT_S  0

/** LP_GPIO_STATUS_REG register
 *  LP_GPIO interrupt status register
 */
#define LP_GPIO_STATUS_REG (DR_REG_LP_GPIO_BASE + 0x20)
/** LP_GPIO_STATUS_INTERRUPT : R/W/WTC; bitpos: [5:0]; default: 0;
 *  The interrupt status of LP_GPIO0 ~ LP_GPIO5, can be configured by the software.
 *
 *  - Bit0 ~ bit5 are corresponding to LP_GPIO0 ~ LP_GPIO5. Bitxx ~ bitxx is invalid.
 *  - Each bit represents the status of its corresponding LP_GPIO:
 *
 *  - 0: Represents the LP_GPIO does not generate the interrupt configured by
 *  LP_GPIO_PIN$n_INT_TYPE, or this bit is configured to 0 by the software.
 *  - 1: Represents the LP_GPIO generates the interrupt configured by
 *  LP_GPIO_PIN$n_INT_TYPE, or this bit is configured to 1 by the software.
 *
 */
#define LP_GPIO_STATUS_INTERRUPT    0x0000003FU
#define LP_GPIO_STATUS_INTERRUPT_M  (LP_GPIO_STATUS_INTERRUPT_V << LP_GPIO_STATUS_INTERRUPT_S)
#define LP_GPIO_STATUS_INTERRUPT_V  0x0000003FU
#define LP_GPIO_STATUS_INTERRUPT_S  0

/** LP_GPIO_STATUS_W1TS_REG register
 *  LP_GPIO interrupt status set register
 */
#define LP_GPIO_STATUS_W1TS_REG (DR_REG_LP_GPIO_BASE + 0x24)
/** LP_GPIO_STATUS_W1TS : WT; bitpos: [5:0]; default: 0;
 *  Configures whether or not to set the interrupt status register
 *  LP_GPIO_STATUS_INTERRUPT of LP_GPIO0 ~ LP_GPIO5.
 *
 *  - Bit0 ~ bit5 are corresponding to LP_GPIO0 ~ LP_GPIO5. Bitxx ~ bitxx is invalid.
 *  - If the value 1 is written to a bit here, the corresponding bit in
 *  LP_GPIO_STATUS_INTERRUPT will be set to 1. \item Recommended operation: use this
 *  register to set LP_GPIO_STATUS_INTERRUPT.
 */
#define LP_GPIO_STATUS_W1TS    0x0000003FU
#define LP_GPIO_STATUS_W1TS_M  (LP_GPIO_STATUS_W1TS_V << LP_GPIO_STATUS_W1TS_S)
#define LP_GPIO_STATUS_W1TS_V  0x0000003FU
#define LP_GPIO_STATUS_W1TS_S  0

/** LP_GPIO_STATUS_W1TC_REG register
 *  LP_GPIO interrupt status clear register
 */
#define LP_GPIO_STATUS_W1TC_REG (DR_REG_LP_GPIO_BASE + 0x28)
/** LP_GPIO_STATUS_W1TC : WT; bitpos: [5:0]; default: 0;
 *  Configures whether or not to clear the interrupt status register
 *  LP_GPIO_STATUS_INTERRUPT of LP_GPIO0 ~ LP_GPIO5.
 *
 *  - Bit0 ~ bit5 are corresponding to LP_GPIO0 ~ LP_GPIO5. Bitxx ~ bitxx is invalid.
 *  - If the value 1 is written to a bit here, the corresponding bit in
 *  LP_GPIO_STATUS_INTERRUPT will be cleared. \item Recommended operation: use this
 *  register to clear LP_GPIO_STATUS_INTERRUPT.
 */
#define LP_GPIO_STATUS_W1TC    0x0000003FU
#define LP_GPIO_STATUS_W1TC_M  (LP_GPIO_STATUS_W1TC_V << LP_GPIO_STATUS_W1TC_S)
#define LP_GPIO_STATUS_W1TC_V  0x0000003FU
#define LP_GPIO_STATUS_W1TC_S  0

/** LP_GPIO_STATUS_NEXT_REG register
 *  LP_GPIO interrupt source register
 */
#define LP_GPIO_STATUS_NEXT_REG (DR_REG_LP_GPIO_BASE + 0x2c)
/** LP_GPIO_STATUS_INTERRUPT_NEXT : RO; bitpos: [5:0]; default: 0;
 *  Represents the interrupt source signal of LP_GPIO0 ~ LP_GPIO5.
 *  Bit0 ~ bit24 are corresponding to LP_GPIO0 ~ LP_GPIO5. Bitxx ~ bitxx is invalid.
 *  Each bit represents:
 *  0: The LP_GPIO does not generate the interrupt configured by LP_GPIO_PIN$n_INT_TYPE.
 *  1: The LP_GPIO generates an interrupt configured by LP_GPIO_PIN$n_INT_TYPE.
 *  The interrupt could be rising edge interrupt, falling edge interrupt, level
 *  sensitive interrupt and any edge interrupt.
 */
#define LP_GPIO_STATUS_INTERRUPT_NEXT    0x0000003FU
#define LP_GPIO_STATUS_INTERRUPT_NEXT_M  (LP_GPIO_STATUS_INTERRUPT_NEXT_V << LP_GPIO_STATUS_INTERRUPT_NEXT_S)
#define LP_GPIO_STATUS_INTERRUPT_NEXT_V  0x0000003FU
#define LP_GPIO_STATUS_INTERRUPT_NEXT_S  0

